app/controllers/fights_controller.rb

SELECT "fighters".* FROM "fighters"
SELECT  "fights".* FROM "fights"  ORDER BY "fights"."upvotes" DESC, upvotes DESC, RANDOM() LIMIT 50
---
  def index
    @fighters = Fighter.all
    @fights = Fight.order("upvotes DESC").order("RANDOM()").first(50)

SELECT "fights".* FROM "fights" WHERE (division = 'Superfight')  ORDER BY "fights"."upvotes" DESC, upvotes DESC, RANDOM()
SELECT "fights".* FROM "fights" WHERE "fights"."division" = $1  ORDER BY "fights"."upvotes" DESC, upvotes DESC, RANDOM()  [["division", "Featherweight"]]
SELECT  "fights".* FROM "fights"  ORDER BY "fights"."upvotes" DESC, upvotes DESC, RANDOM() LIMIT 50
---
  def get_fights

    @fights = []
    if params[:division].to_s == 'None' && params[:superfights].to_s!='true'
      @fights = Fight.where("fighter_one_id = "+params[:the_fighter].to_s + " or fighter_two_id = "+params[:the_fighter].to_s).order("upvotes DESC").order("RANDOM()")
    elsif params[:division].to_s != 'Popular' && params[:superfights].to_s != 'true'
      @fights = Fight.where(division: +params[:division]).order("upvotes DESC").order("RANDOM()")
    elsif params[:superfights].to_s == 'true'
      @fights = Fight.where("division = "+"'Superfight'").order("upvotes DESC").order("RANDOM()")
    else
      @fights = Fight.order("upvotes DESC").order("RANDOM()").first(50)